{"name": "Chronic Obstructive Pulmonary Disease - Pulmonary Embolism","decisional_state": "chosenState","workflow_state": "startedState","node_type": "task_node","children": [{"name": "Chronic Obstructive Pulmonary Disease","source": "Pocket Guide to COPD Diagnosis, Management, and Prevention. A Guide for Health Care Professionals. Global Initiative for Chronic Obstructive Lung Disease Guidelines. Report. 2018","node_type": "task_node","workflow_state": "startedState","decisional_state": "chosenState","children": [{"name": "eligible for COPD test","description": "COPD should be considered in any patient over the age of 40 who has dyspnea, chronic cough or sputum production, and\/or a history of exposure to risk factors for the disease.","node_type": "decision_node","workflow_state": "completedState","decisional_state": "chosenState","children": [{"name": "COPD diagnosis","node_type": "task_node","workflow_state": "startedState","decisional_state": "chosenState","condition": "matches COPD risk factors","children": [{"name": "spirometry test","description": "Spirometry is required to make the diagnosis in this clinical context; the presence of a post-bronchodilator FEV_1\/FVC < 0.70 confirms the presence of persistent airflow limitation and thus of COPD in patients with appropriate symptoms and significant exposures to noxious stimuli","node_type": "task_node","workflow_state": "activeState","decisional_state": "chosenState"},{"name": "check indicators","description": "COPD should be considered in any patient over the age of 40 who has dyspnea, chronic cough or sputum production, and\/or a history of exposure to risk factors for the disease.\r\n\t\r\n\tA detailed medical history of a new patient who is known, or suspected, to have COPD should include:\r\n\t- Patient's exposure to risk factors, such as smoking and occupational or environmental exposures.\r\n\t- Past medical history, including asthma, allergy, sinusitis, or nasal polyps; respiratory infections in childhood; other chronic respiratory and non-respiratory diseases.\r\n\t- Family history of COPD or other chronic respiratory disease.\r\n\t- Pattern of symptom development: COPD typically develops in adult life and most patients are conscious of increased breathlessness, more frequent or prolonged \"winter colds,\" and some social restriction for a number of years before seeking medical help.\r\n\t- History of exacerbations or previous hospitalizations for respiratory disorder. Patients may be aware of periodic worsening of symptoms even if these episodes have not been identified as exacerbations of COPD.\r\n\t- Presence of comorbidities, such as heart disease, osteoporosis, musculoskeletal disorders, and malignancies that may also contribute to restriction of activity.\r\n\t- Impact of disease on patient's life, including limitation of activity, missed work and economic impact, effect on family routines, feelings of depression or anxiety, well-being and sexual activity.\r\n\t- Social and family support available to the patient.\r\n\t- Possibilities for reducing risk factors, especially smoking cessation.\r\n\t","node_type": "task_node","workflow_state": "activeState","decisional_state": "chosenState"},{"name": "diagnosis outcome","node_type": "decision_node","workflow_state": "activeState","decisional_state": "chosenState","children": [{"name": "COPD assessment","description": " The goals of COPD assessment are to determine the level of airflow limitation, its impact on the patient's health status and the risk of future events (such as exacerbations, hospital admissions or death), in order to, eventually, guide therapy.\r\n\r\nTo achieve these goals, COPD assessment must consider the following aspects of the disease separately:\r\n- The presence and severity of the spirometric abnormality\r\n- Current nature and magnitude of the patient's symptoms\r\n- History of moderate and severe exacerbations and future risk\r\n- Presence of comorbidities","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","condition": "post-broncho < 0.7 AND indicator match","children": [{"name": "assess COPD symptoms","description": "It should be noted that there is only a weak correlation between FEV_1, symptoms and impairment of a patient's health status.\r\nFor this reason, formal symptomatic assessment is required.\r\nIt is now recognized that COPD impacts patients beyond just dyspnea. For this reason, a comprehensive assessment of symptoms is recommended rather than just a measure of breathlessness. \r\nThe most comprehensive disease-specific health status questionnaires such as the Chronic Respiratory Questionnaire (CRQ) and St. George's Respiratory Questionnaire (SGRQ) are too complex to use in routine practice, but shorter comprehensive measures e.g., COPD Assessment Test (CAT) and The COPD Control Questionnaire (The CCQ) have been developed and are suitable.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "COPD treatment","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState"}]},{"name": "assess airflow limitation severity","description": "The classification of airflow limitation severity in COPD is shown in Table 2.4. \r\n\tSpecific spirometric cut-points are used for purposes of simplicity. \r\n\tSpirometry should be performed after the administration of an adequate dose of at least one short-acting inhaled bronchodilator in order to minimize variability.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "COPD treatment","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState"}]},{"name": "assess COPD exacerbation risk","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "COPD treatment","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState"}]},{"name": "COPD differential diagnosis","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "COPD X Ray","description": "A chest X-ray is not useful to establish a diagnosis in COPD, but it is valuable in excluding alternative diagnoses and establishing the presence of significant comorbidities such as concomitant respiratory (pulmonary fibrosis, bronchiectasis, pleural diseases), skeletal (e.g., kyphoscoliosis),\tand cardiac diseases (e.g., cardiomegaly). See table 2.7 for details.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "COPD treatment","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState"}]},{"name": "COPD CT Scan","description": "See table 2.7 for details","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "COPD treatment","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState"}]}]}]}]}]}]}]},{"name": "Pulmonary Embolism","source": "2019 ESC Guidelines for the diagnosis and management of acute pulmonary embolism developed in collaboration with the European Respiratory Society (ERS). Konstantinides S Meyer G Becattini C Bueno H Geersing G et. al. European Heart Journal 2020 vol: 41 (4) pp: 543-603","node_type": "task_node","workflow_state": "startedState","decisional_state": "chosenState","children": [{"name": "check general PE presentation","description": "The clinical signs and symptoms of acute PE are non-specific. In most cases, PE is suspected in a patient with dyspnoea, chest pain, pre-syncope or syncope, or haemoptysis.\r\n\tHaemodynamic instability is a rare but important form of clinical presentation, as it indicates central or extensive PE with severely reduced haemodynamic reserve. \r\n\tSyncope may occur, and is associated with a higher prevalence of haemodynamic instability and RV dysfunction. Conversely,and according to the results of a recent study, acute PE may be a frequent finding in patients presenting with syncope (17%), even in the presence of an alternative explanation.","node_type": "decision_node","workflow_state": "completedState","decisional_state": "chosenState","children": [{"name": "pre-test PE assessment","description": "The combination of symptoms and clinical findings with the presence of predisposing factors for VTE allows the classification of patients with suspected PE into distinct categories of clinical or pre-test probability, which correspond to an increasing actual prevalence of confirmed PE. \r\n\tThis pre-test assessment can be done either by implicit (empirical) clinical judgement or by using prediction rules.\r\n\t As the post-test (i.e. after an imaging test) probability of PE depends not only on the characteristics of the diagnostic test itself but also on the pre-test probability, this is a key step in all diagnostic algorithms for PE.","node_type": "decision_node","workflow_state": "completedState","decisional_state": "chosenState","condition": "matching PE presentation","children": [{"name": "check PE rule-out criteria","description": "Searching for PE in every patient with dyspnoea or chest pain may lead to high costs and complications of unnecessary tests. \r\nThe Pulmonary Embolism Rule-out Criteria (PERC) were developed for emergency department patients with the purpose of selecting, on clinical grounds, patients whose likelihood of having PE is so low that diagnostic workup should not even be initiated. \r\nThey comprise eight clinical variables significantly associated with an absence of PE: age < 50 years; pulse < 100 beats per minute; SaO2 > 94%; no unilateral leg swelling; no haemoptysis; no recent trauma or surgery; no history of VTE; and no oral hormone use. \r\nThe results of a prospective validation study, and those of a randomized non-inferiority management study, suggested safe exclusion of PE in patients with low clinical probability who, in addition, met all criteria of the PERC rule.\r\nHowever, the low overall prevalence of PE in these studies does not support the generalizability of the results.","node_type": "decision_node","workflow_state": "completedState","decisional_state": "chosenState","condition": "high pre-test probability","children": [{"name": "PE D-dimer test","description": "D-dimer levels are elevated in plasma in the presence of acute thrombosis because of simultaneous activation of coagulation and fibrinolysis. \r\nThe negative predictive value of D-dimer testing is high, and a normal D-dimer level renders acute PE or DVT unlikely. \r\nOn the other hand, the positive predictive value of elevated D-dimer levels is low and D-dimer testing is not useful for confirmation of PE.","node_type": "decision_node","workflow_state": "completedState","decisional_state": "chosenState","condition": "not matching criteria","children": [{"name": "PE diagnosis","node_type": "task_node","workflow_state": "activeState","decisional_state": "chosenState","condition": "abnormal D-dimer level","children": [{"name": "PE multidetector CTPA","description": "Multidetector CTPA is the method of choice for imaging the pulmonary vasculature in patients with suspected PE. \r\n\tIt allows adequate visualization of the pulmonary arteries down to the subsegmental level.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "PE risk stratification","description": "Risk stratification of patients with acute PE is mandatory for determining the appropriate therapeutic management approach. \r\n\tInitial risk stratification is based on clinical symptoms and signs of haemodynamic instability (Table 4), which indicate a high risk of early death. \r\n \t\r\n \tIn the large remaining group of patients with PE who present without haemodynamic instability, further (advanced) risk stratification requires the assessment of two sets of prognostic criteria: \r\n \t(i) clinical, imaging, and laboratory indicators of PE severity, mostly related to the presence of RV dysfunction; and \r\n \t(ii) presence of comorbidity and any other aggravating conditions that may adversely affect early prognosis.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "PE treatment","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState"}]}]},{"name": "PE lung scintigraphy","description": "The planar ventilation\/perfusion [V\/Q (lung scintigraphy)] scan is an established diagnostic test for suspected PE.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "PE risk stratification","description": "Risk stratification of patients with acute PE is mandatory for determining the appropriate therapeutic management approach. \r\n\tInitial risk stratification is based on clinical symptoms and signs of haemodynamic instability (Table 4), which indicate a high risk of early death. \r\n \t\r\n \tIn the large remaining group of patients with PE who present without haemodynamic instability, further (advanced) risk stratification requires the assessment of two sets of prognostic criteria: \r\n \t(i) clinical, imaging, and laboratory indicators of PE severity, mostly related to the presence of RV dysfunction; and \r\n \t(ii) presence of comorbidity and any other aggravating conditions that may adversely affect early prognosis.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "PE treatment","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState"}]}]},{"name": "PE pulmonary angiography","description": "For several decades, pulmonary angiography was the 'gold standard' for the diagnosis or exclusion of acute PE, but it is now rarely performed as less-invasive CTPA offers similar diagnostic accuracy.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "PE risk stratification","description": "Risk stratification of patients with acute PE is mandatory for determining the appropriate therapeutic management approach. \r\n\tInitial risk stratification is based on clinical symptoms and signs of haemodynamic instability (Table 4), which indicate a high risk of early death. \r\n \t\r\n \tIn the large remaining group of patients with PE who present without haemodynamic instability, further (advanced) risk stratification requires the assessment of two sets of prognostic criteria: \r\n \t(i) clinical, imaging, and laboratory indicators of PE severity, mostly related to the presence of RV dysfunction; and \r\n \t(ii) presence of comorbidity and any other aggravating conditions that may adversely affect early prognosis.","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState","children": [{"name": "PE treatment","node_type": "task_node","workflow_state": "inactiveState","decisional_state": "chosenState"}]}]}]}]}]}]}]}]}]}